Revit 2025 API
ExternalDataInstanceRemovingFromDocumentEventArgs.InstanceId Property
 The Revit id of the external data instance being removed from Revit document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId InstanceId { get; }
Public ReadOnly Property InstanceId As ElementId
	Get
public:
property ElementId^ InstanceId {
	ElementId^ get ();
}
member InstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
ExternalDataInstanceRemovingFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace